public class Main {
    public static void main(String[] args) {

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран

        // входные данные
        int amount = 1000;

        // логика программы
        int one = 20;
        int bonus = amount / one;

        System.out.println("Ваш бонус составит:" + bonus);

    }

}


